{
  "vocab_size": 30,
  "char_to_idx": {
    "<pad>": 0,
    "<unk>": 1,
    "<sos>": 2,
    "<eos>": 3,
    "a": 4, "b": 5, "c": 6, "d": 7, "e": 8, "f": 9, "g": 10, "h": 11,
    "i": 12, "j": 13, "k": 14, "l": 15, "m": 16, "n": 17, "o": 18, "p": 19,
    "q": 20, "r": 21, "s": 22, "t": 23, "u": 24, "v": 25, "w": 26, "x": 27,
    "y": 28, "z": 29
  },
  "idx_to_char": {
    "0": "<pad>", "1": "<unk>", "2": "<sos>", "3": "<eos>",
    "4": "a", "5": "b", "6": "c", "7": "d", "8": "e", "9": "f", "10": "g", "11": "h",
    "12": "i", "13": "j", "14": "k", "15": "l", "16": "m", "17": "n", "18": "o", "19": "p",
    "20": "q", "21": "r", "22": "s", "23": "t", "24": "u", "25": "v", "26": "w", "27": "x",
    "28": "y", "29": "z"
  },
  "special_tokens": {
    "pad_token": "<pad>", "pad_idx": 0,
    "unk_token": "<unk>", "unk_idx": 1,
    "sos_token": "<sos>", "sos_idx": 2,
    "eos_token": "<eos>", "eos_idx": 3
  }
}
